#pragma once

#include <SFML\Graphics.hpp>
#include <SFML\Audio.hpp>
const int HEIGHT_MAP = 25;//размер карты высота
const int WIDTH_MAP = 40;//размер карты ширина 


sf::String TileMap[HEIGHT_MAP] = {
	"0000000000000000000000000000000000000000",
	"0                                      0",
	"0           1       m                  0",
	"0                                      0",
	"0       1         1        h           0",
	"0   h                                  0",
	"0          1    h                      0",
	"0                                      0",
	"0                                      0",
	"0    1                                 0",
	"0                    h                 0",
	"0                                      0",
	"0                                      0",
	"0             m  m   m                 0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0000000000000000000000000000000000000000",
};